# Aggregate Functions/Methods
- It is often useful to compute summary statistics

### Load the data

In [7]:
import pandas as pd

# Create a data frame (load the data from a csv file)
filename = 'Ex_Files_Python_for_Data_Vis/Exercise Files/Pandas/data/car_financing.csv'
df = pd.read_csv(filename)

In [8]:
# Check the first few rows of data
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [9]:
# Create filters
car_filter = df['car_type'] == 'Toyota Sienna'
interest_filter = df['interest_rate'] == 0.0702

In [11]:
# Apply filters and update data frame
df = df.loc[car_filter & interest_filter, :]

### Compute summary statistics

In [13]:
# Calculate the sum of all the values in a single column
df['Interest Paid'].sum()

np.float64(6543.509999999999)

In [15]:
# Calculate the sum of all the values in the data frame
#   - Ignores all NA/null values by default
df.sum()

Month                                                            1830
Starting Balance                                           1118598.13
Repayment                                                     41233.8
Interest Paid                                                 6543.51
Principal Paid                                               34690.29
New Balance                                                1083907.84
term                                                             3600
interest_rate                                                   4.212
car_type            Toyota SiennaToyota SiennaToyota SiennaToyota ...
dtype: object